Tarea4/Orquestador/src/jbiServiceUnits/Orquestador.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="Orquestador1"
             xmlns:tns="Orquestador1" xmlns:ns="http://j2ee.netbeans.org/wsdl/BpelModule2/src/ESBfront" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/BpelModule2/src/ESBfront" location="../jbiServiceUnits/BpelModule2/ESBfront.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:ESBfrontPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ESBfrontOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="Orquestador1"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="Orquestador1"/>
            </output>
        </operation>
    </binding>
    <service name="Orquestador1Service1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/Orquestador1Service1/casaPort1"/>
        </port>
    </service>
</definitions>
