Tarea4/Orquestador/test/prube/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:orq="Orquestador1">
  <soapenv:Body>
    <orq:ESBfrontOperation>
      <idCliente>1234Prue</idCliente>
      <coordX>1.051732</coordX>
      <coordY>1.051732E7</coordY>
    </orq:ESBfrontOperation>
  </soapenv:Body>
</soapenv:Envelope>